# GridEndSegmentColor Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..GridEndSegmentColor Property
ParameterTypeId Class See Also
---
"End Segment Color"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId GridEndSegmentColor { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property GridEndSegmentColor As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ GridEndSegmentColor {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace